SAME70Examples/c_09_spi/include/extra_defines_same70.h
#ifndef _EXTRA_DEFINES_SAME70_H
#define _EXTRA_DEFINES_SAME70_H

#define PMC_PCR_CMD_READ (0<<12)
#define PMC_PCR_CMD_WRITE (1<<12)

#define PMC_PCR_PID_UART0 (7)
#define PMC_PCR_PID_UART1 (8)
#define PMC_PCR_PID_SMC (9)
#define PMC_PCR_PID_PIOA (10)
#define PMC_PCR_PID_PIOB (11)
#define PMC_PCR_PID_PIOC (12)
#define PMC_PCR_PID_USART0 (13)
#define PMC_PCR_PID_USART1 (14)
#define PMC_PCR_PID_USART2 (15)
#define PMC_PCR_PID_PIOD (16)
#define PMC_PCR_PID_PIOE (17)
#define PMC_PCR_PID_HSMCI (18)
#define PMC_PCR_PID_TWIHS0 (19)
#define PMC_PCR_PID_TWIHS1 (20)
#define PMC_PCR_PID_SPI0 (21)
#define PMC_PCR_PID_SSC (22)
#define PMC_PCR_PID_TC0 (23)
#define PMC_PCR_PID_TC1 (24)
#define PMC_PCR_PID_TC2 (25)
#define PMC_PCR_PID_TC3 (26)
#define PMC_PCR_PID_TC4 (27)
#define PMC_PCR_PID_TC5 (28)
#define PMC_PCR_PID_AFEC0 (29)
#define PMC_PCR_PID_DACC (30)
#define PMC_PCR_PID_PWM0 (31)
#define PMC_PCR_PID_ICM (32)
#define PMC_PCR_PID_ACC (33)
#define PMC_PCR_PID_USBHS (34)
#define PMC_PCR_PID_MCAN0 (35)
#define PMC_PCR_PID_MCAN1 (37)
#define PMC_PCR_PID_GMAC (39)
#define PMC_PCR_PID_AFEC1 (40)
#define PMC_PCR_PID_TWIHS2 (41)
#define PMC_PCR_PID_SPI1 (42)
#define PMC_PCR_PID_QSPI (43)
#define PMC_PCR_PID_UART2 (44)
#define PMC_PCR_PID_UART3 (45)
#define PMC_PCR_PID_UART4 (46)
#define PMC_PCR_PID_TC6 (47)
#define PMC_PCR_PID_TC7 (48)
#define PMC_PCR_PID_TC8 (49)
#define PMC_PCR_PID_TC9 (50)
#define PMC_PCR_PID_TC10 (51)
#define PMC_PCR_PID_TC11 (52)
#define PMC_PCR_PID_AES (56)
#define PMC_PCR_PID_TRNG (57)
#define PMC_PCR_PID_XDMAC (58)
#define PMC_PCR_PID_ISI (59)
#define PMC_PCR_PID_PWM1 (60)

#endif// _EXTRA_DEFINES_SAME70_H
